# -*- coding: utf-8 -*-

feng = u'鳳'
te = u'特'
shang = u'上'
ban = u'般'

dong = u'東'
nan = u'南'

shi = u'喰'
chi = u'赤'
su = u'速'

si = u'四'
san = u'三'

DANs = {    
                u'新人' : 0 , 
                u'９級' : 1 ,
                u'８級' : 2 ,
                u'７級' : 3 ,
                u'６級' : 4 ,
                u'５級' : 5 ,
                u'４級' : 6 ,
                u'３級' : 7 ,
                u'２級' : 8 ,
                u'１級' : 9 ,
                u'初段' : 10 ,
                u'二段' : 11 ,
                u'三段' : 12 ,
                u'四段' : 13 ,
                u'五段' : 14 ,
                u'六段' : 15 ,
                u'七段' : 16 ,
                u'八段' : 17 ,
                u'九段' : 18 ,
                u'十段' : 19 ,
                u'天鳳位' : 20 ,
        }

PT_Mid  = [ 0 ,  0,  0,  0,  0,  0,  0,   0,   0,   0, 200, 400, 600, 800, 1000, 1200, 1400, 1600, 1800, 2000, None  ]
PT_Ceil = [ 30, 30, 30, 60, 60, 60, 90, 100, 100, 100, 400, 800, 1200, 1600, 2000, 2400, 2800, 3200, 3600, 4000, None  ]

PTinc = {
        ban     : [ None, +45, +0,  +0],
        shang   : [ None, +60, +15, +0],
        te      : [ None, +75, +30, +0],
        feng    : [ None, +90, +45, +0]
        } 

PTdec = [
         -0    ,   #New
         -0    ,   #9k
         -0    ,   #8k
         -0    ,   #7k
         -0    ,   #6k
         -0    ,   #5k
         -0    ,   #4k
         -0    ,   #3k
         -15   ,   #2k
         -30   ,   #1k
         -45   ,   #1d
         -60   ,   #2d
         -75   ,   #3d
         -90   ,   #4d
         -105  ,   #5d
         -120  ,   #6d
         -135  ,   #7d
         -150  ,   #8d
         -165  ,   #9d
         -180  ,   #10d
         -0    ,    #Tenhou
        ]

def __main__():
    pass

if __name__ == '__main__':
    __main__()

